Autodesk.Revit.DB.SunStudyTimeInterval.Minute
Interval occurs every minute.

Autodesk.Revit.DB.SunStudyTimeInterval.Seconds45
Interval occurs every 45 seconds.

Autodesk.Revit.DB.SunStudyTimeInterval.Seconds30
Interval occurs every 30 seconds.

Autodesk.Revit.DB.SunStudyTimeInterval.Seconds15
Interval occurs every 15 seconds.